CSI API ETABS v1
cDesignStrip.Delete Method
 Deletes the specified Design Strip
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Delete(
	string Name
)
Function Delete (
	Name As String
) As Integer
Dim instance As cDesignStrip
Dim Name As String
Dim returnValue As Integer
returnValue = instance.Delete(Name)
int Delete(
	String^ Name
)
abstract Delete :
        Name : string -> int
Parameters
Name
Type: System.String
 The name of an existing Design Strip
Return Value
Type: Int32
 Returns zero if the Design Strip is successfully deleted, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new Design Strip with name "MyDesignStrip1A" ; currently not available in API
'change DesignStrip name
    ret = SapModel.DesignStrip.Delete("MyDesignStrip1A")
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDesignStrip Interface
ETABSv1 Namespace